## Production: buckets
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 5 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                      |
|--------|------------------------------------------------|
| update | `module.curated_bucket.aws_s3_bucket.this`     |
|        | `module.log_bucket.aws_s3_bucket.this`         |
|        | `module.log_bucket.aws_s3_bucket_policy.this`  |
|        | `module.raw_bucket.aws_s3_bucket.this`         |
|        | `module.transformed_bucket.aws_s3_bucket.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.curated_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "cds-data-lake-curated-production"
        tags                        = {
            "CostCentre" = "PlatformDataLake"
            "Critical"   = "false"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)

      + lifecycle_rule {
          + enabled = true
          + id      = "remove_noncurrent_versions"
        }

        # (4 unchanged blocks hidden)
    }

  # module.log_bucket.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.log_bucket.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deny_insecure_transport" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::cds-data-lake-bucket-logs-production",
              + "arn:aws:s3:::cds-data-lake-bucket-logs-production/*",
            ]
          + sid       = "denyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.log_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "cds-data-lake-bucket-logs-production"
        tags                        = {
            "CostCentre" = "PlatformDataLake"
            "Critical"   = "true"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

      ~ lifecycle_rule {
          ~ id                                     = "NGZmNDVkY2QtZWE3Ny00MWUxLTk1N2QtYTQ5MjM0ZTgxNmZj" -> "expire_all"
            tags                                   = {}
            # (3 unchanged attributes hidden)

          ~ expiration {
              ~ expired_object_delete_marker = false -> true
                # (2 unchanged attributes hidden)
            }
        }
      + lifecycle_rule {
          + enabled = true
          + id      = "remove_noncurrent_versions"
        }

        # (4 unchanged blocks hidden)
    }

  # module.log_bucket.aws_s3_bucket_policy.this will be updated in-place
  ~ resource "aws_s3_bucket_policy" "this" {
        id     = "cds-data-lake-bucket-logs-production"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::cds-data-lake-bucket-logs-production/*",
                          - "arn:aws:s3:::cds-data-lake-bucket-logs-production",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.raw_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "cds-data-lake-raw-production"
        tags                        = {
            "CostCentre" = "PlatformDataLake"
            "Critical"   = "false"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)

      + lifecycle_rule {
          + enabled = true
          + id      = "remove_noncurrent_versions"
        }

        # (4 unchanged blocks hidden)
    }

  # module.transformed_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "cds-data-lake-transformed-production"
        tags                        = {
            "CostCentre" = "PlatformDataLake"
            "Critical"   = "false"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)

      + lifecycle_rule {
          + enabled = true
          + id      = "remove_noncurrent_versions"
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.curated_bucket.aws_s3_bucket.this,
  on .terraform/modules/curated_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 17 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
